{ 
  "highlights": [

    {
      "title": "CMS Sherlock",
      "description": "I've spent time with several CMS/CMFs and learned some quirks about them all. The big ones (Drupal and Wordpress) are definitely in heavy rotation, but also played with static site tools (Nanoc and Jekyll) and dabbled in the proprietary CMS realm, too. Need help figuring out which one to go with? I can help.",
      "icon": "fa-code" 
    },

    {
      "title": "JavaScript Tooler",
      "description": "Always looking to play with new tools, I've tried out a variety of them: jQuery, underscore, AngularJS, Gulp, Grunt, Mustache, Handlebar, domo and JavaScript classic. Alwaysa eager to add to the list and work with new tools.",
      "icon": ""
    },

    {
      "title": "Tools of the Trade",
      "description": "Love working with lean fast tools so I stick with <em>vim</em> which gives me the tools to quickly deploy and move on.",
      "icon": "fa-terminal"
    },

    {
      "title": "The Browser Game",
      "description": "It's important to stay on top of all the changes and challenges that come up developing for the web. It used to be a dark world wide web, but many improvements in browsers helped.",
      "icon": "fa-internet-explorer"
    },

    {
      "title": "Remember When",
      "description": "So important to any workflow today is a proper version control tool. So far only one really excels at this, git.",
      "icon": "fa-code-fork"
    },

    {
      "title": "Search/Analytics",
      "description": "Google Analytics, Google Tag Manager, SEO/SEM Best Practices, Apache Solr, Google Site Search",
      "icon": "fa-line-chart"
    },

    {
      "title": "Databases",
      "description": "With any CMS/CMF tools come the databases to store all that C. I am familiar with MySQL, rethinkdb.",
      "icon": "fa-database"
    }
  ],

  "projects": [

    {
      "id": "vangogh",
      "name": "<em>Van Gogh's Bedrooms</em> promotional site",
      "description": "With a blockbuster exhibition down the road it was important to help promote it as well as provide fun ways for our marketing and social media teams to engage with people. Working with our graphic design and marketing teams, I created a site for the ads around the city to drive to, provided an interactive quiz for our social media team to engage with followers, and a place for video, special offers, and more content.",
      "tools": [
        "Ruby",
        "JavaScript",
        "jQuery",
        "Foundation",
        "HTML/CSS"
      ]
    },

    {
      "id": "vangogh-quiz",
      "name": "<em>Van Gogh's Bedrooms</em> quiz",
      "description": "",
      "tools": [
        "JavaScript",
        "jQuery",
        "AngularJS",
        "Foundation",
        "HTML/CSS"
      ]
    },

    {
      "id": "visitaic",
      "name": "VisitArtInstitute.com",
      "description": "Tourism landing page for ad campaigns.",
      "tools": [
        "Foundation",
        "HTML/CSS",
        "JavaScript",
        "jQuery"
      ]
    },
    {
      "id": "artthrob",
      "name": "<em>Who's Your #ArtThrob?</em> Valentine's Day quiz",
      "description": "",
      "tools": [
        "Foundation",
        "HTML/CSS",
        "JavaScript",
        "jQuery",
        "dōmo"
      ]
    }

  ]
}
